[
  {
    "id": "workshop3d-29082020",
    "type" : "online",
    "title": "Workshop on 3D Modeling using Blender",
    "date" : "August 29, 2020",
    "summary": "The workshop focused on teaching students to effectively use <b>Blender</b> for 3D modelling, and was conducted by <b>Jamius Siam</b>, Associate Software Engineer, Therap Services. LLC and Instructor, Graphics Design and Game Development, Ministry of ICT Division, Bangladesh.",
    "content": [
      ["txt", "From August 25th to August 29th, 2020 <b>“BRAC University Computer Club (BUCC)”</b> arranged an event titled <b>“Workshop on 3D Modeling using Blender”</b>. The workshop was conducted by <b>Jamius Siam</b>, Associate Software Engineer, Therap Services. LLC and Instructor, Graphics Design and Game Development, Ministry of ICT Division, Bangladesh. The event was held for 3 days (25th, 27th, and 29th August)  through Live Online Media Platforms such as BUCC’s Facebook and Youtube Page and Google Classroom. The goal of the workshop was to introduce 3D Modelling to the students using <b>Blender</b> software and make them familiar with the functions of the software."],
      ["txt", "On the first day roughly at 7 o’clock in the evening, Mr. Jamius Siam started the first session by showing how to download Blender. Then, he asked about the expectations from Blender to the participants. Also, He shared some examples of Blender. Moreover, He explained shading, which is needed for painting in Blender software. Furthermore, he elaborated about editing by using photos in Blender. In the rest of the session, Mr. Jamius Siam showed some important management options of Blender like panels, windows, phases, etc. He wrapped up the first session with another Q/A session and talking about the sharing projects students have to do which was mandatory for the Workshop. <b>Shanjida Habib Shormi</b>, Director of Communication and Marketing Department of BUCC, was helping him to collect questions from the participants. More than 60 learners participated in the session"],
      ["txt", "The second day of the workshop started on <b>August 27, 2020</b>, at around 07 PM. Jamius Siam started with a short recap of the previous day. He mentioned some terminologies to follow for creating 3D Models and Scenes. Then he continued the workshop by talking about the text and material properties of models. He showed some uses of those features by making an Object. Lighting was his next talking point of the workshop. After that, he moved on to work on the scene model. The next topic he talked about was the Principal shader and its many different parameters."],
      ["txt", "According to him, the Rendering Engine and Render System are two big parts of Blender as it helps to improve performance of 3D Modeling. He mentioned that Setting up cameras and viewport shading is also important in 3D Modeling. Furthermore, he talked about GPU and Compute based rendering which might help to improve performance. Following that, He showed how to add and configure light sources. He continued discussing shader parameters, Roughness, and methods of fine control. He also explained the basics of UV Map and UV Unwrap. Additionally, He described working with objects by using a built-in complex object. As a part of that, He talked about some more depth features such as details on lighting styles and types as well as shadows. Finally, with another brief Q/A session, the second day of the workshop concluded. The objective of the second day was to learn how to create a 3D scene using a blender, focusing on shading."],
      ["txt", "On the final day of 29th August, the workshop began at around the same time as the previous days. Jamius Siam started the session by talking about some workarounds which may help students to learn effectively. He suggested the participants follow some video tutorials of the Youtube Channel ‘<b>Blender Guru</b>’. Then he mentioned some of the usefulness of Modifiers and showed some of the examples of it. After that, he moved on to Sculpting. He showed a great example of sculpting using Dynamic Topology and how to increase smoothness and add geometries to objects. Moreover, he discussed some other examples of Light Sources continued from the previous day. After that,  He taught different types of Nodes such as Color, Reflection, Roughness, Shader, etc, and the use of these Nodes. He made an object made of glass using the features and Nodes he taught in the class. Later, he explained animation on Blender and how to move objects using keyframes. Finally, he ended the Workshop by discussing the different aspects of Game Development and a Q/A Session with the students on google classroom. Jamius Siam also encouraged the students by sharing his experiences and gave them some valuable tips. The participants showed their gratitude to Jamius Siam for hosting this effective and well-maintained workshop."],
      ["txt", "The credit for PR of this event goes to <b>Sanjib Kumar Sen</b>, <b>Jawad Ibn Mamoon</b>, and <b>Tonusree Talukder</b>."]
    ]
  },
  {
    "id": "womenRock-07112019",
    "type" : "offline",
    "title": "Women Rock IT: Rise of Women Technopreneurs",
    "date" : "November 07, 2019",
    "summary": "The workshop intended to celebrate women in tech, inspire young women who are majoring in tech related fields to move forward, and was arranged by <b>Cisco Bangladesh</b>.",
    "content": [
      ["txt", "<b>BRAC University Computer Club (BUCC)</b>, in cooperation with <b>Cisco Bangladesh</b>, organized an event titled <b>“Women Rock IT: Rise of Women Technopreneurs”</b> by <b>Cisco</b> and <b>UNV</b> on the 7th of November at the office of Cisco Bangladesh. <b>Annajiat Alim Rasel</b>, Advisor of BUCC and Lecturer, Department of Computer Science and Engineering, BRAC University, and several members of BUCC were present. This program was held via live TV broadcast video conference where <b>Jackie Dujmovic</b>, CEO/Founder of <b>Hover UAV</b>, and <b>Azellia Alma Shafira</b> CEO, <b>Banoo Indonesia</b>, were the technopreneurs who shared their inspirational life journeys."],
      ["img", "https://raw.githubusercontent.com/Ostitter-Anondo/pr-articles-api/refs/heads/main/images/womenRock-07112019/women-rock-1.jpg"],
      ["txt", "Dujmovic began with her life story. Consequently, she described her project which is working with drones at the beaches. She also added that Hover UAV operates from Australia and all around the world. She mentioned some segments of her project which are: drone trails, shark alarms, increasing drone capabilities, shark behavioral research, etc. They spotted this species of marine life through their project. They have a special helpline for shark-related emergencies. To utilize the usage of drones, training sessions are being hosted by them. DNA of sharks is obtained for research by collecting the water splashed by sharks. In conclusion, she also discussed the different usages of a drone as well as career options with drones - for example, video editing, data analysis, electronic maintenance skill, etc."],
      ["txt", "Shafira, a business major student, shifted to the field of technology and co-invented Banoo. Banoo is an IoT and renewable energy-based technology innovation to empower fish farmers in Indonesia and to realize the Sustainable Development Goals (SDGs). Consequently, she talked about technology and what her team is currently using for agriculture. Their slogan is: Invest in Water, Relieve Hunger. As agriculture is based on water, their investment is directed and solely based on water. Their technology is eco-friendly. Traditional cultivation system affects the environment in many ways such as fertilizers for cultivation pollute the water as well as the soil. Banoo countered this problem by increasing productivity and sustainable energy, which in turn increased the oxygen level of water to increase the rate of fish cultivation."],
      ["txt", "After the discussion of two technopreneurs, the host of this series allowed a question/answer session. Conference attendees of this live TV broadcast were allowed to clarify their doubts by asking questions. For instance, Mr. Annajiat asked two questions. One of them was the challenges faced and subsequent initiatives required to obtain drone licenses in countries that closely regulated the use of drones. Secondly, fresh undergraduates deciding to become entrepreneurs or get employed in a stable job or simultaneously doing both. After the Q/A session <b>Ms. Rubaiya Rahtin</b>, Assistant Professor of <b>United International University</b>, shared her life story and gave some valuable advice to the students. Thus, after taking a group picture the program ended."],
      ["img", "https://raw.githubusercontent.com/Ostitter-Anondo/pr-articles-api/refs/heads/main/images/womenRock-07112019/women-rock-2.jpg"],
      ["txt","Special thanks go to <b>Rubayat Jahan Roshne, Habiba Bint Obaid, Humayun Ahmed, Moumita Mostafa, Aiman Jabeen Ramisa, Iman Chowdhury, Sarah Tanzim, Shams Shahariar Shovon, Syed Ziaul bin Bashar, Ms Ayesha Siddika, Hafsa, Fatema Ahsan, Mekhala Mariam Mary, Tarannum Jahan Sultana, Sreya Sanyal Puja, Md Muntaha Islam, Md Ashikur Rahman, Meshaq Monsur, Kazi Fahd Zakwan</b> and <b>Sad Murshid Khan Adon</b>. The credit for PR of this event goes to <b>Meshaq Monsur</b>."]
    ]
  }
]